app/controllers/home_controller.rb

SELECT "messages".* FROM "messages"
---
  def index
    @msgs = Message.all