app/controllers/messages_controller.rb

  def index
    @msgs = Message.all
---
SELECT "messages".* FROM "messages"

  def create
    @msg = Message.new(msg_params)

    respond_to do |format|
      if @msg.save
---
INSERT INTO "messages" ("name", "content", "published", "valid_to", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

    def set_msg
      @msg = Message.find(params[:id])
---
SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]