app/controllers/regions_controller.rb

SELECT "regions".* FROM "regions"
---
  def index
    @regions = Region.all

INSERT INTO "regions" ("code", "created_at", "updated_at") VALUES (?, ?, ?)  [["code", ""], ["created_at", "2017-06-25 07:02:41.732359"], ["updated_at", "2017-06-25 07:02:41.732359"]]
---
  def create
    @region = Region.new(region_params)

    respond_to do |format|
      if @region.save

UPDATE "regions" SET "name" = ?, "code" = ?, "is_active" = ?, "updated_at" = ? WHERE "regions"."id" = ?  [["name", "Asia"], ["code", "APAC"], ["is_active", "t"], ["updated_at", "2017-06-25 07:03:56.090737"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @region.update(region_params)

SELECT  "regions".* FROM "regions" WHERE "regions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_region
      @region = Region.find(params[:id])